<details><summary>SSH KEY GEN</summary>

```diff
DEBU[0000] Running command: tofu apply                   prefix=[/home/sgune/codebase/aks/tg-root/dev/ssh] 
Acquiring state lock. This may take a few moments...
random_pet.ssh_key_name: Refreshing state... [id=sshallowedpiglet]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # azapi_resource.ssh_public_key will be created
  + resource "azapi_resource" "ssh_public_key" {
      + body                      = jsonencode({})
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "eastus"
      + name                      = "sshallowedpiglet"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/0f8ed921-d9a8-41b0-aeca-1b4dbab56daa/resourceGroups/sgune-rg"
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.Compute/sshPublicKeys@2023-07-01"
    }

  # azapi_resource_action.ssh_public_key_gen will be created
  + resource "azapi_resource_action" "ssh_public_key_gen" {
      + action                 = "generateKeyPair"
      + id                     = (known after apply)
      + method                 = "POST"
      + output                 = (known after apply)
      + resource_id            = (known after apply)
      + response_export_values = [
          + "publicKey",
          + "privateKey",
        ]
      + type                   = "Microsoft.Compute/sshPublicKeys@2023-07-01"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + key_data = (known after apply)

Do you want to perform these actions?
  OpenTofu will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

azapi_resource.ssh_public_key: Creating...
azapi_resource.ssh_public_key: Still creating... [10s elapsed]
azapi_resource.ssh_public_key: Still creating... [20s elapsed]
azapi_resource.ssh_public_key: Still creating... [30s elapsed]
azapi_resource.ssh_public_key: Still creating... [40s elapsed]
azapi_resource.ssh_public_key: Still creating... [50s elapsed]
azapi_resource.ssh_public_key: Still creating... [1m0s elapsed]
azapi_resource.ssh_public_key: Still creating... [1m10s elapsed]
azapi_resource.ssh_public_key: Still creating... [1m20s elapsed]
azapi_resource.ssh_public_key: Creation complete after 1m27s [id=/subscriptions/0f8ed921-d9a8-41b0-aeca-1b4dbab56daa/resourceGroups/sgune-rg/providers/Microsoft.Compute/sshPublicKeys/sshallowedpiglet]
azapi_resource_action.ssh_public_key_gen: Creating...
azapi_resource_action.ssh_public_key_gen: Creation complete after 2s [id=/subscriptions/0f8ed921-d9a8-41b0-aeca-1b4dbab56daa/resourceGroups/sgune-rg/providers/Microsoft.Compute/sshPublicKeys/sshallowedpiglet/generateKeyPair]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```
</details>
